 /* Сортировка Шелла. 
  * Дан массив n действительных чисел. 
  * Требуется упорядочить его по возрастанию. 
  * Делается это следующим образом: сравниваются два соседних элемента ai и ai+1. 
  * Если ai <= ai+1, то продвигаются на один элемент вперед. Если ai > ai+1, то производится перестановка и сдвигаются на один элемент назад.
  * Составить алгоритм этой сортировки.*/

package by.koroza.algorithmization.sorting;

public class NumberSix {

	public static void main(String[] args) {
		

	}

}