/* Сортировка обменами. 
 * Дана последовательность чисел a1 <= a2 <= ... <= an. 
 * Требуется переставить числа в порядке возрастания. 
 * Для этого сравниваются два соседних числа ai и ai+1. Если ai > ai+1, то делается перестановка. 
 * Так продолжается до тех пор, пока все элементы не станут расположены в порядке возрастания. 
 * Составить алгоритм сортировки, подсчитывая при этом количества перестановок. 
 * */

package by.koroza.algorithmization.sorting;

public class NumberFour {

	public static void main(String[] args) {
		

	}

}
